# переменная name - В переменных храниться информация
# name = "Valery"
# weather = "пасмурно"
# sum = 110.5

# int - Целочисленное число
# number = 5
# age = 28

# Float - Дробное число
# fnumber = 5.7

# round - Округление

# str - строка
# name = "Valery"

# Булево значение bool
# status = True/False

# print - Вывод информации на экран

# print ( "Привет, " + name + "!" )
# print ( "Сейчас на улице " + weather + ", а у тебя в кармане " + str(sum) + "$" )

# Конкатенация
# print( f"Привет, {name}!" )
# print( f"Сейчас на улице {weather}! А у тебя в кармане ${sum} " )

# \n - перевод строки

# Конкатенация с использованием F строки используются для того, чтобы не добавлять плюсики в коде.
# Обязательно использовать скобки {Текст}

# weight = input( "Укажите ваш вес: " ) # Запрашиваем вес человека

# print( f"Ваш вес {weight}кг" )

# Модули чтобы подключить модуль нужно прописать import и после пробела указать название модуля

# import random


# print ( random.randint(1, 5) )

# Математические операции +, -, * - умножить, / - разделить, // - Разделить без остатка,
# ** - Возвездение в степень, % - деление по модулю, унарный минус, округление и число Пи

# print ( 5 + 5 )

# a = 50
# b = 3

# print ( a + b )

# import math
# a = 23.7
# b = 4

# print( math.ceil(a) )
