# Задача 1
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
#
# if a == b:
#     print('переменные равны')
# else:
#     print('переменные не равны')


# Задача 2
# a = int(input("Введите число: "))
#
# if a % 2 == 1:
#     print("число нечетное")
# else:
#     print('число четное')


# Задача 3
# a = int(input("Введите первое число: "))
# b = int(input("Введите второе число: "))
# c = int(input("Введите третье число: "))
#
# max = 0
# for i in a, b, c:
#     if max < i:
#         max = i
# print(max)


# Задача 4
# a = [9, 6, 10, 13, 1]
# a.sort()
# lengh = len(a)
# print(f'длина списка: {lengh}')
# print(f'сортированный список: {a}')


# Задача 5
# a = [8, 3, 1, 1, 9, 1]
#
# count = 0 # Сколько единиц
# for i in a:
#     if i == 1:
#         count += 1
# print(f"Количество единиц: {count}")
#
# if count % 3 == 0:
#     print('количество единиц кратно трем')
# else:
#     print('Количество единиц не кратно трем')

#  Задача 6
# def primer (x, z):
#     a = x**2-z*x+5*z
#     return a
#
# y = primer(5, 13)
# print("Ответ", y)


# задача 7
# a = [1, 2, 3, 4, 5]
# print(a)
# a.pop(0)
# print(a)